Обработки/Reports/_СравнительныйОтчетОСтоимостиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СравнительныйОтчетОСтоимостиАктивов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СравнительныйОтчетОСтоимостиАктивов/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Сравнительный отчет о стоимости активов",
		"0.19",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Период		= НастройкиОтчета.Период.ДатаОкончания;
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СформироватьОтчет(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	&ПоследнийРабочийДень КАК ПоследнийРабочийДень,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период)));
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция СчитатьТабличныйДокументВТаблицуЗначений(ИмяМакета, СекцияЗаголовки, СекцияДанные, СекцияКолонки)
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	//будем считать, что у всех макетов с настройками одинаковая структура
	ОбластьЗаголовки = Макет.ПолучитьОбласть(СекцияЗаголовки+"|" + СекцияКолонки);
	ОбластьДанные = Макет.ПолучитьОбласть(СекцияДанные +"|" + СекцияКолонки);
	
	Рез = Новый ТаблицаЗначений;
	
	Если ОбластьЗаголовки.ВысотаТаблицы > 1 Тогда 
		Сообщить("Неправильная структура секции заголовков в Макете " + ИмяМакета);
		Возврат Рез;
	КонецЕсли;	
	
	КоличествоКолонок = ОбластьЗаголовки.ШиринаТаблицы;
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для инд = 1 по КоличествоКолонок Цикл 
		Рез.Колонки.Добавить(ОбластьЗаголовки.ПолучитьОбласть(1, инд).ТекущаяОбласть.Текст);
	КонецЦикла;	
	
	Для индСтроки = 1 по КоличествоСтрок Цикл 
		НоваяСтрока = Рез.Добавить();
		Для индКолонки = 1 по КоличествоКолонок Цикл 
			НоваяСтрока[ИндКолонки-1] = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;		
		КонецЦикла;	
	КонецЦикла;	

	Если СекцияКолонки="Колонки" Тогда 
		Рез.ЗаполнитьЗначения(0, "Кол4, Кол5, Кол6, Кол7, Кол8");
	КонецЕсли;	
	
	Возврат Рез;
	
КонецФункции	

Процедура РасчетКолонок6_8(ТабОтчета, Часть)
	
	Для Каждого СтрокаОтчет из ТабОтчета Цикл 
	
		Попытка 
			Ставка = Число(СтрокаОтчет.Ставка);
		Исключение
			Ставка = 0;
		КонецПопытки;	
		
		РазницаЕПС_НУ = Окр((СтрокаОтчет.Кол4 - СтрокаОтчет.Кол5)*Ставка/100, 2);
		
		Если РазницаЕПС_НУ > 0 Тогда 
			СтрокаОтчет.Кол6 = РазницаЕПС_НУ;
			СтрокаОтчет.Кол7 = 0;
		Иначе
			СтрокаОтчет.Кол6 = 0;
			СтрокаОтчет.Кол7 = - РазницаЕПС_НУ;
		КонецЕсли;
		Если РазницаЕПС_НУ <> 0 Тогда 
			СтрокаОтчет.Кол8 = РазницаЕПС_НУ; 
		КонецЕсли;	
		
		Если (СтрокаОтчет.СтрИтог="1") И (Часть=1) Тогда 
			СтрокаОтчет.Кол4 = ТабОтчета.Итог("Кол4");
			СтрокаОтчет.Кол5 = ТабОтчета.Итог("Кол5");
			СтрокаОтчет.Кол6 = ТабОтчета.Итог("Кол6");
			СтрокаОтчет.Кол7 = ТабОтчета.Итог("Кол7");
			СтрокаОтчет.Кол8 = ТабОтчета.Итог("Кол8");
		ИначеЕсли (СтрокаОтчет.СтрИтог="1") И (Часть=2) Тогда 
			//строка 220 - код 22 сейчас не заполнена 			
			СтрокаОтчет.Кол4 = ТабОтчета.Итог("Кол4");
			СтрокаОтчет.Кол5 = ТабОтчета.Итог("Кол5");
			СтрокаОтчет.Кол6 = ТабОтчета.Итог("Кол6");
			СтрокаОтчет.Кол7 = ТабОтчета.Итог("Кол7");
			СтрокаОтчет.Кол8 = ТабОтчета.Итог("Кол8");
			
			
			Строка220 = ТабОтчета.Найти("220", "НомерСтр");
			Строка220.Кол8 = 0;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Группировка", "22");			
			СтрокиРасшифковки = ТабОтчета.НайтиСтроки(Отбор);
			Для Каждого СтрРасшифровка из СтрокиРасшифковки Цикл 
				Строка220.Кол4 = Строка220.Кол4 + СтрРасшифровка.Кол4;
				Строка220.Кол5 = Строка220.Кол5 + СтрРасшифровка.Кол5;
				Строка220.Кол6 = Строка220.Кол6 + СтрРасшифровка.Кол6;
				Строка220.Кол7 = Строка220.Кол7 + СтрРасшифровка.Кол7;
				Строка220.Кол8 = Строка220.Кол8 + СтрРасшифровка.Кол8;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура Распределить(ТабОтчета, Выборка)
	
	КодСтроки = "";
	КодСтрокиНКД = "";
	
	Если (Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Акции) И (Выборка.Статус = Перечисления.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже) Тогда
		КодСтроки = "1";
	ИначеЕсли (Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Акции) И (Выборка.Статус <> Перечисления.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже) Тогда
		КодСтроки = "2";
	ИначеЕсли (Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Паи) И (Выборка.Статус = Перечисления.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже) Тогда
		КодСтроки = "3";
	ИначеЕсли (Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Паи) И (Выборка.Статус <> Перечисления.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже) Тогда
		КодСтроки = "1";
	ИначеЕсли (Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации) И (Выборка.Статус = Перечисления.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже) Тогда
		Если Выборка.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда     //Ипотечная + Еврооблигаия
			КодСтроки = "5";
		Иначе
			КодСтроки = "8";
		КонецЕсли;	
		КодСтрокиНКД = "9";
	ИначеЕсли (Выборка.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации) И (Выборка.Статус <> Перечисления.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже) Тогда		
		Если Выборка.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда 
			КодСтроки = "6";
		Иначе
			КодСтроки = "8";
		КонецЕсли;	
		КодСтрокиНКД = "10";
	КонецЕсли;	
	
	Если КодСтроки <> "" Тогда
		СтрокаОтчета = ТабОтчета.Найти(КодСтроки, "КодСтр");
		СтрокаОтчета.Кол4 = СтрокаОтчета.Кол4+Выборка.СтоимостьЕПС;
		СтрокаОтчета.Кол5 = СтрокаОтчета.Кол5+Выборка.СтоимостьНУ;		
	КонецЕсли;	
	
	Если КодСтрокиНКД <> "" Тогда
		СтрокаОтчета = ТабОтчета.Найти(КодСтрокиНКД, "КодСтр");
		СтрокаОтчета.Кол4 = СтрокаОтчета.Кол4+Выборка.СтоимостьКупонаЕПС;
		СтрокаОтчета.Кол5 = СтрокаОтчета.Кол5+Выборка.СтоимостьКупонаНУ;		
	КонецЕсли;	
		
КонецПроцедуры	

Процедура РаспределитьДебет(ТабОтчета, Выборка)
	
	КодСтроки = ?(ПустаяСтрока(Выборка.КодСтрокиЕПС),Выборка.КодСтрокиНУ, Выборка.КодСтрокиЕПС);
	
	Если КодСтроки <> "" Тогда
		СтрокаОтчета = ТабОтчета.Найти(КодСтроки, "КодСтр");
		СтрокаОтчета.Кол4 = СтрокаОтчета.Кол4+Выборка.СуммаОстатокЕПС;
		СтрокаОтчета.Кол5 = СтрокаОтчета.Кол5+Выборка.СуммаОстатокНУ;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура РаспределитьДоходыРасходы(ТабОтчета, Выборка, ШаблонРасшифровка, ДопНомер);
	
	КодСтроки = "22"; 
	//других пока нет. 
	//цикл оставил для общноости решения. Вдруг появятся строки 20, 21	
	
	// строку 220 здесь не заполняем, заполнение в РасчетКолонок6_8
	
	//СтрокаОтчета = ТабОтчета.Найти(КодСтроки, "КодСтр");
	//СтрокаОтчета.Кол4 = СтрокаОтчета.Кол4+Выборка.ФинРезЕПС;
	//СтрокаОтчета.Кол5 = СтрокаОтчета.Кол5+Выборка.ФинРезНУ;		
	
	КодРасшифровки = Выборка.КодСтроки;
	СтрРасшифровка = ШаблонРасшифровка.Найти(КодРасшифровки, "Стр");
	
	Если СтрРасшифровка <> Неопределено Тогда 
		
		ТекущаяСтрока = ТабОтчета.Найти(Строка(ДопНомер), "НомерСтр");
		Индекс = ТабОтчета.Индекс(ТекущаяСтрока);
		
		СтрокаОтчета = ТабОтчета.Вставить(Индекс+1);
		СтрокаОтчета.Название = СтрРасшифровка.Название;
		СтрокаОтчета.НомерСтр = Строка(ДопНомер+1);
		СтрокаОтчета.Ставка = СтрРасшифровка.Ставка;
		СтрокаОтчета.Кол4 = Выборка.ФинРезЕПС;
		СтрокаОтчета.Кол5 = Выборка.ФинРезНУ;
		СтрокаОтчета.Кол6 = 0;
		СтрокаОтчета.Кол7 = 0;
		СтрокаОтчета.Кол8 = 0;
		СтрокаОтчета.Группировка = КодСтроки;   //Данные расшифровки в итог не будем брать. 
	КонецЕсли;
	
КонецПроцедуры	

Процедура ВыводОтчета(ТабОтчета, ОбластьСтрока, ДокументРезультат)
	
	
	Для Каждого СтрокаОтчет из ТабОтчета Цикл 
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаОтчет);		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;	
	
	
КонецПроцедуры	

Функция ЗапросАктивы()
	
	Запрос = Новый Запрос;
	
	//активы
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток) КАК СтоимостьНУ,
	|	СУММА(БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток) КАК СтоимостьКупонаНУ,
	|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок
	|ПОМЕСТИТЬ _НалоговыеПартии
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&ДатаОтчетная,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК БухПартииЦенныхБумагОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.Рынок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток) КАК СтоимостьЕПС,
	|	СУММА(БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток) КАК СтоимостьКупонаЕПС
	|ПОМЕСТИТЬ _ЕПСПартии
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&ДатаОтчетная,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЦенныхБумагСрезПоследних.Период КАК Период,
	|	СтатусыЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СтатусыЦенныхБумагСрезПоследних.Статус КАК Статус,
	|	СтатусыЦенныхБумагСрезПоследних.Биржа КАК Биржа,
	|	СтатусыЦенныхБумагСрезПоследних.Рынок КАК Рынок,
	|	СтатусыЦенныхБумагСрезПоследних.Активен КАК Активен
	|ПОМЕСТИТЬ _Обращаемые
	|ИЗ
	|	РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
	|			&ДатаОтчетная,
	|			Статус = ЗНАЧЕНИЕ(Перечисление.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_НалоговыеПартии.ЦеннаяБумага
	|					ИЗ
	|						_НалоговыеПартии)) КАК СтатусыЦенныхБумагСрезПоследних
	|ГДЕ
	|	СтатусыЦенныхБумагСрезПоследних.Активен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_НалоговыеПартии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЕСТЬNULL(_НалоговыеПартии.СтоимостьНУ, 0) КАК СтоимостьНУ,
	|	ЕСТЬNULL(_НалоговыеПартии.СтоимостьКупонаНУ, 0) КАК СтоимостьКупонаНУ,
	|	_Обращаемые.Статус КАК Статус,
	|	ЕСТЬNULL(_ЕПСПартии.СтоимостьЕПС, 0) КАК СтоимостьЕПС,
	|	ЕСТЬNULL(_ЕПСПартии.СтоимостьКупонаЕПС, 0) КАК СтоимостьКупонаЕПС,
	|	_НалоговыеПартии.Рынок КАК Рынок,
	|	ВЫРАЗИТЬ(_НалоговыеПартии.ЦеннаяБумага КАК Справочник.Облигации).Категория КАК Категория
	|ИЗ
	|	_НалоговыеПартии КАК _НалоговыеПартии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕПСПартии КАК _ЕПСПартии
	|		ПО _НалоговыеПартии.ЦеннаяБумага = _ЕПСПартии.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Обращаемые КАК _Обращаемые
	|		ПО _НалоговыеПартии.ЦеннаяБумага = _Обращаемые.ЦеннаяБумага";
	
	

		
	Запрос.УстановитьПараметр("СчетДУ", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОтчетная", Новый Граница(КонецДня(Период), ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции	

Функция ЗапросДебет()
	
	//Дебиторка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыйУчетОстатки.Счет КАК Счет,
	|	НалоговыйУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	|	НалоговыйУчетОстатки.Субконто1 КАК Субконто1,
	|	ВЫБОР
	|		КОГДА НалоговыйУчетОстатки.Счет.Код = ""76.57""
	|			ТОГДА ""13""
	|		КОГДА НалоговыйУчетОстатки.Счет.Код = ""76.67""
	|			ТОГДА ""13""
	|		КОГДА НалоговыйУчетОстатки.Счет.Код = ""76.3""
	|			ТОГДА ""15""
	|		КОГДА НалоговыйУчетОстатки.Счет.Код = ""55.5""
	|			ТОГДА ""18""
	|		КОГДА НалоговыйУчетОстатки.Счет.Код = ""76.54""
	|			ТОГДА ""19""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодСтроки
	|ПОМЕСТИТЬ ДебетНУ
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
	|			&ДатаОтчетная,
	|			Счет В (&СписокСчетов),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ) КАК НалоговыйУчетОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""13"" КАК КодСтроки,
	|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
	|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт
	|ПОМЕСТИТЬ ДебетЕПС
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&ДатаОтчетная,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ) КАК ЕдиныйБухгалтерскийУчетОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""15"",
	|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
	|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&ДатаОтчетная,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ) КАК ЕдиныйБухгалтерскийУчетОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""18"",
	|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
	|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&ДатаОтчетная,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ) КАК ЕдиныйБухгалтерскийУчетОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""19"",
	|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
	|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&ДатаОтчетная,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения14),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона)) КАК ЕдиныйБухгалтерскийУчетОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДебетЕПС.КодСтроки КАК КодСтрокиЕПС,
	|	ДебетНУ.КодСтроки КАК КодСтрокиНУ,
	|	ЕСТЬNULL(ДебетЕПС.СуммаОстатокДт, 0) КАК СуммаОстатокЕПС,
	|	ЕСТЬNULL(ДебетНУ.СуммаОстатокДт, 0) КАК СуммаОстатокНУ
	|ИЗ
	|	ДебетНУ КАК ДебетНУ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДебетЕПС КАК ДебетЕПС
	|		ПО (ДебетЕПС.КодСтроки = ДебетНУ.КодСтроки)";
	
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Основной.ПроцентыПоДепозитнымВкладам);
	СписокСчетов.Добавить(ПланыСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку);
	СписокСчетов.Добавить(ПланыСчетов.Основной.РасчетыПоПричитающимсяДивидендам);
	СписокСчетов.Добавить(ПланыСчетов.Основной.ДепозитныеСчета);
	СписокСчетов.Добавить(ПланыСчетов.Основной.ПогашениеКупона);
	
	Запрос.УстановитьПараметр("СчетДУ", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОтчетная", Новый Граница(КонецДня(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции	

Функция ЗапросДоходыРасходы()
		
	// сделать промежуточный запрос по НУ с детализацией для расшифровки
	// таблицы с данным для расшифровки берем из Менеджера временных таблиц.
	
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_вава").ПолучитьДанные().Выбрать();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов КАК АналитикаДоходов,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации КАК АналитикаДоходовОтРеализации,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки КАК АналитикаДоходовОтПереоценки
	|ПОМЕСТИТЬ _НастройкиУчета
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&ДатаОтчетная,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК НастройкиУчетаАктивовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""3"" КАК КодСтроки,
	|	_НастройкиУчета.АналитикаДоходов КАК Аналитика
	|ПОМЕСТИТЬ _Аналитики
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2"",
	|	_НастройкиУчета.АналитикаДоходов
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2"",
	|	_НастройкиУчета.АналитикаДоходовОтРеализации
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2"",
	|	_НастройкиУчета.АналитикаДоходовОтПереоценки
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1"",
	|	_НастройкиУчета.АналитикаДоходов
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1"",
	|	_НастройкиУчета.АналитикаДоходовОтРеализации
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1"",
	|	_НастройкиУчета.АналитикаДоходовОтПереоценки
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""7"",
	|	_НастройкиУчета.АналитикаДоходов
	|ИЗ
	|	_НастройкиУчета КАК _НастройкиУчета
	|ГДЕ
	|	_НастройкиУчета.УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПроцентыНаМНО), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПроцентыНаСМО), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПроцентыНаФЕО))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""4"",
	|	НастройкиУчетаКомиссииСрезПоследних.Аналитика
	|ИЗ
	|	РегистрСведений.НастройкиУчетаКомиссии.СрезПоследних(
	|			&ДатаОтчетная,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(ПЕречисление.ВидыУчета.НалоговыйУчет)) КАК НастройкиУчетаКомиссииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыйУчетОбороты.СуммаОборотКт - НалоговыйУчетОбороты.СуммаОборотДт КАК ФинРез,
	|	_Аналитики.КодСтроки КАК КодСтроки,
	|	_Аналитики.Аналитика КАК Аналитика,
	|	НалоговыйУчетОбороты.Субконто2 КАК ЦеннаяБумага,
	|	НалоговыйУчетОбороты.Счет КАК Счет
	|ПОМЕСТИТЬ _РасшифровкаНУ
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
	|			&ДатаНачальная,
	|			&ДатаОтчетная,
	|			Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы)
	|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ,
	|			,
	|			) КАК НалоговыйУчетОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Аналитики КАК _Аналитики
	|		ПО (_Аналитики.Аналитика = НалоговыйУчетОбороты.Субконто1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(_РасшифровкаНУ.ФинРез) КАК ФинРез,
	|	_РасшифровкаНУ.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ _ДанныеНУ
	|ИЗ
	|	_РасшифровкаНУ КАК _РасшифровкаНУ
	|
	|СГРУППИРОВАТЬ ПО
	|	_РасшифровкаНУ.КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕдиныйБухгалтерскийУчетОбороты.Счет.Родитель КАК СчетРодитель,
	|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
	|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК ЦенныеБумаги,
	|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК ГФУ,
	|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт КАК СуммаОборотКт,
	|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОбороты.Субконто1 КАК Справочник.Облигации).Категория КАК Категория,
	|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет
	|ПОМЕСТИТЬ _БалансЕПС
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	|			&ДатаНачальная,
	|			&ДатаОтчетная,
	|			Период,
	|			,
	|			&Субконто,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ,
	|			,
	|			) КАК ЕдиныйБухгалтерскийУчетОбороты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЕдиныйБухгалтерскийУчетОбороты.Счет.Родитель,
	|	ЕдиныйБухгалтерскийУчетОбороты.Счет,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕдиныйБухгалтерскийУчетОбороты.Субконто1,
	|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотДт,
	|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборотКт,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
	|			&ДатаНачальная,
	|			&ДатаОтчетная,
	|			Период,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности)),
	|			&СубконтоГФУ,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ,
	|			,
	|			) КАК ЕдиныйБухгалтерскийУчетОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""4"" КАК КодСтроки,
	|	_БалансЕПС.Счет КАК Счет,
	|	_БалансЕПС.ГФУ КАК ГФУ,
	|	_БалансЕПС.ЦенныеБумаги КАК ЦенныеБумаги,
	|	-_БалансЕПС.СуммаОборотДт КАК ФинРез,
	|	_БалансЕПС.Категория КАК Категория
	|ПОМЕСТИТЬ _РасшифровкаЕПС
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеДоходыРасходы))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""4"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	-_БалансЕПС.СуммаОборотДт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	_БалансЕПС.СуммаОборотКт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01)
	|	И (_БалансЕПС.ГФУ.Код = ""31150""
	|			ИЛИ _БалансЕПС.ГФУ.Код = ""31128"")
	|	И _БалансЕПС.Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""1"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	_БалансЕПС.СуммаОборотКт - _БалансЕПС.СуммаОборотДт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы))
	|	И _БалансЕПС.Счет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01)
	|	И _БалансЕПС.ГФУ.Код <> ""31150""
	|	И _БалансЕПС.ГФУ.Код <> ""31128""
	|	И _БалансЕПС.Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
	|	И _БалансЕПС.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	_БалансЕПС.СуммаОборотКт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01)
	|	И (_БалансЕПС.ГФУ.Код = ""31150""
	|			ИЛИ _БалансЕПС.ГФУ.Код = ""31128"")
	|	И _БалансЕПС.Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""2"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	_БалансЕПС.СуммаОборотКт - _БалансЕПС.СуммаОборотДт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы))
	|	И _БалансЕПС.Счет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы01)
	|	И _БалансЕПС.ГФУ.Код <> ""31150""
	|	И _БалансЕПС.ГФУ.Код <> ""31128""
	|	И _БалансЕПС.Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""5"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	_БалансЕПС.СуммаОборотКт - _БалансЕПС.СуммаОборотДт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.СчетРодитель = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций)
	|	И _БалансЕПС.ГФУ.Код В (""33203"", ""34201"", ""34202"", ""43201"", ""43202"", ""42203"")
	|	И _БалансЕПС.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""7"",
	|	_БалансЕПС.Счет,
	|	_БалансЕПС.ГФУ,
	|	_БалансЕПС.ЦенныеБумаги,
	|	_БалансЕПС.СуммаОборотКт - _БалансЕПС.СуммаОборотДт,
	|	_БалансЕПС.Категория
	|ИЗ
	|	_БалансЕПС КАК _БалансЕПС
	|ГДЕ
	|	_БалансЕПС.СчетРодитель = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы)
	|	И _БалансЕПС.ГФУ.Код В (""31120"")
	|	И _БалансЕПС.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_РасшифровкаЕПС.КодСтроки КАК КодСтроки,
	|	СУММА(_РасшифровкаЕПС.ФинРез) КАК ФинРез
	|ПОМЕСТИТЬ _ДанныеЕПС
	|ИЗ
	|	_РасшифровкаЕПС КАК _РасшифровкаЕПС
	|
	|СГРУППИРОВАТЬ ПО
	|	_РасшифровкаЕПС.КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА _ДанныеНУ.КодСтроки ЕСТЬ NULL
	|			ТОГДА _ДанныеЕПС.КодСтроки
	|		ИНАЧЕ _ДанныеНУ.КодСтроки
	|	КОНЕЦ КАК КодСтроки,
	|	ЕСТЬNULL(_ДанныеНУ.ФинРез, 0) КАК ФинРезНУ,
	|	ЕСТЬNULL(_ДанныеЕПС.ФинРез, 0) КАК ФинРезЕПС
	|ИЗ
	|	_ДанныеНУ КАК _ДанныеНУ
	|		ПОЛНОЕ СОЕДИНЕНИЕ _ДанныеЕПС КАК _ДанныеЕПС
	|		ПО _ДанныеНУ.КодСтроки = _ДанныеЕПС.КодСтроки";
	
	СписокСубконто = Новый Массив;
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);		
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов);
	
	Запрос.УстановитьПараметр("СчетДУ", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОтчетная", Новый Граница(КонецДня(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаНачальная", НачалоГода(Период));
	Запрос.УстановитьПараметр("Субконто", СписокСубконто);
	Запрос.УстановитьПараметр("СубконтоГФУ", ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов);

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции	

Процедура СформироватьОтчет(ДокументРезультат, ДокументРасшифровка)  Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТабОтчета = СчитатьТабличныйДокументВТаблицуЗначений("Настройка", "Загл", "Шаблон", "Колонки");			
	// 1 часть отчета. Активы
	// Распределяем ценные бумаги
	
	Выборка = ЗапросАктивы();
	Пока Выборка.Следующий() Цикл 
		Распределить(ТабОтчета, Выборка);
	КонецЦикла;	
	
	
	// дебиторка
	Выборка = ЗапросДебет();
	Пока Выборка.Следующий() Цикл 
		РаспределитьДебет(ТабОтчета, Выборка);
	КонецЦикла;		
	
	//вывод отчета 
	Отчет = ПолучитьМакет("Отчет");
	
	ОбластьЗаголовок = Отчет.ПолучитьОбласть("Заголовок");
	
	ПараметрыШапки = ПолучитьПараметрыШапки();	
	ОбластьЗаголовок.Параметры.Заполнить(ПараметрыШапки);
	ОбластьЗаголовок.Параметры.ДатаПодписиОтчета = ТекущаяДата();
	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	
	ОбластьШапка = Отчет.ПолучитьОбласть("ШапкаДоходы");
	ДокументРезультат.Вывести(ОбластьШапка);
	
	РасчетКолонок6_8(ТабОтчета, 1);
	ОбластьСтрока = Отчет.ПолучитьОбласть("Строка");	
	ВыводОтчета(ТабОтчета, ОбластьСтрока, ДокументРезультат);	
	
	
	// 2 часть отчета
	// доходы-расходы
	ТабОтчета = СчитатьТабличныйДокументВТаблицуЗначений("Настройка", "Загл", "Шаблон2", "Колонки");
	
	ОбластьШапка = Отчет.ПолучитьОбласть("ШапкаРасходы");
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ШаблонРасшифровка = СчитатьТабличныйДокументВТаблицуЗначений("Настройка", "ЗаглДиР", "ШаблонДиР", "КолонкиДР");
	
	ДопНомер = 220;
	Выборка = ЗапросДоходыРасходы();
	Пока Выборка.Следующий() Цикл 
		РаспределитьДоходыРасходы(ТабОтчета, Выборка, ШаблонРасшифровка, ДопНомер);
		ДопНомер = ДопНомер + 1;
	КонецЦикла;		
	
	РасчетКолонок6_8(ТабОтчета, 2);
	ВыводОтчета(ТабОтчета, ОбластьСтрока, ДокументРезультат);	
	
	
	// Подписи		
	//СтруктураКлюча = Новый Структура;
	//СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	//СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	//СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	//СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	
//	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
